qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/include/hardware/regs/spi.h
#define SPI_SSPPCELLID0_SSPPCELLID0_ACCESS "RO"
// =============================================================================
// Register    : SPI_SSPPCELLID1
// Description : PrimeCell identification registers, SSPPCellID0-3 on page 3-16
#define SPI_SSPPCELLID1_OFFSET _u(0x00000ff4)
#define SPI_SSPPCELLID1_BITS   _u(0x000000ff)
#define SPI_SSPPCELLID1_RESET  _u(0x000000f0)
// -----------------------------------------------------------------------------
// Field       : SPI_SSPPCELLID1_SSPPCELLID1
// Description : These bits read back as 0xF0
#define SPI_SSPPCELLID1_SSPPCELLID1_RESET  _u(0xf0)
#define SPI_SSPPCELLID1_SSPPCELLID1_BITS   _u(0x000000ff)
#define SPI_SSPPCELLID1_SSPPCELLID1_MSB    _u(7)
#define SPI_SSPPCELLID1_SSPPCELLID1_LSB    _u(0)
#define SPI_SSPPCELLID1_SSPPCELLID1_ACCESS "RO"
// =============================================================================
// Register    : SPI_SSPPCELLID2
// Description : PrimeCell identification registers, SSPPCellID0-3 on page 3-16
#define SPI_SSPPCELLID2_OFFSET _u(0x00000ff8)
#define SPI_SSPPCELLID2_BITS   _u(0x000000ff)
#define SPI_SSPPCELLID2_RESET  _u(0x00000005)
// -----------------------------------------------------------------------------
// Field       : SPI_SSPPCELLID2_SSPPCELLID2
// Description : These bits read back as 0x05
#define SPI_SSPPCELLID2_SSPPCELLID2_RESET  _u(0x05)
#define SPI_SSPPCELLID2_SSPPCELLID2_BITS   _u(0x000000ff)
#define SPI_SSPPCELLID2_SSPPCELLID2_MSB    _u(7)
#define SPI_SSPPCELLID2_SSPPCELLID2_LSB    _u(0)
#define SPI_SSPPCELLID2_SSPPCELLID2_ACCESS "RO"
// =============================================================================
// Register    : SPI_SSPPCELLID3
// Description : PrimeCell identification registers, SSPPCellID0-3 on page 3-16
#define SPI_SSPPCELLID3_OFFSET _u(0x00000ffc)
#define SPI_SSPPCELLID3_BITS   _u(0x000000ff)
#define SPI_SSPPCELLID3_RESET  _u(0x000000b1)
// -----------------------------------------------------------------------------
// Field       : SPI_SSPPCELLID3_SSPPCELLID3
// Description : These bits read back as 0xB1
#define SPI_SSPPCELLID3_SSPPCELLID3_RESET  _u(0xb1)
#define SPI_SSPPCELLID3_SSPPCELLID3_BITS   _u(0x000000ff)
#define SPI_SSPPCELLID3_SSPPCELLID3_MSB    _u(7)
#define SPI_SSPPCELLID3_SSPPCELLID3_LSB    _u(0)
#define SPI_SSPPCELLID3_SSPPCELLID3_ACCESS "RO"
// =============================================================================
#endif // HARDWARE_REGS_SPI_DEFINED
